<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CountrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $countries = [
            'أفغانستان', 'ألبانيا', 'الجزائر', 'أندورا', 'أنغولا', 'أنتيغوا وبربودا', 'الأرجنتين', 'أرمينيا', 'أستراليا', 'النمسا',
            'أذربيجان', 'الباهاما', 'البحرين', 'بنغلاديش', 'بربادوس', 'بيلاروسيا', 'بلجيكا', 'بليز', 'بنين', 'بوتان',
            'بوليفيا', 'البوسنة والهرسك', 'بوتسوانا', 'البرازيل', 'بروناي', 'بلغاريا', 'بوركينا فاسو', 'بوروندي', 'كمبوديا', 'الكاميرون',
            'كندا', 'الرأس الأخضر', 'جمهورية أفريقيا الوسطى', 'تشاد', 'تشيلي', 'الصين', 'كولومبيا', 'جزر القمر', 'الكونغو', 'كوستاريكا',
            'كرواتيا', 'كوبا', 'قبرص', 'التشيك', 'الدنمارك', 'جيبوتي', 'دومينيكا', 'جمهورية الدومينيكان', 'الإكوادور', 'مصر',
            'السلفادور', 'غينيا الاستوائية', 'إريتريا', 'إستونيا', 'إسواتيني', 'إثيوبيا', 'فيجي', 'فنلندا', 'فرنسا', 'غابون',
            'غامبيا', 'جورجيا', 'ألمانيا', 'غانا', 'اليونان', 'غرينادا', 'غواتيمالا', 'غينيا', 'غينيا بيساو', 'غيانا', 'هايتي',
            'هندوراس', 'هنغاريا', 'أيسلندا', 'الهند', 'إندونيسيا', 'إيران', 'العراق', 'أيرلندا', 'إسرائيل', 'إيطاليا', 'جامايكا',
            'اليابان', 'الأردن', 'كازاخستان', 'كينيا', 'كيريباتي', 'الكويت', 'قرغيزستان', 'لاوس', 'لاتفيا', 'لبنان', 'ليسوتو',
            'ليبيريا', 'ليبيا', 'ليختنشتاين', 'ليتوانيا', 'لوكسمبورغ', 'مدغشقر', 'مالاوي', 'ماليزيا', 'جزر المالديف', 'مالي', 'مالطا',
            'جزر مارشال', 'موريتانيا', 'موريشيوس', 'المكسيك', 'ميكرونيزيا', 'مولدوفا', 'موناكو', 'منغوليا', 'الجبل الأسود', 'المغرب',
            'موزمبيق', 'ميانمار', 'ناميبيا', 'ناورو', 'نيبال', 'هولندا', 'نيوزيلندا', 'نيكاراغوا', 'النيجر', 'نيجيريا', 'كوريا الشمالية',
            'مقدونيا الشمالية', 'النرويج', 'عمان', 'باكستان', 'بالاو', 'بنما', 'بابوا غينيا الجديدة', 'باراغواي', 'بيرو', 'الفلبين',
            'بولندا', 'البرتغال', 'قطر', 'رومانيا', 'روسيا', 'رواندا', 'سانت كيتس ونيفيس', 'سانت لوسيا', 'سانت فينسنت والغرينادين',
            'ساموا', 'سان مارينو', 'ساو تومي وبرينسيبي', 'السعودية', 'السنغال', 'صربيا', 'سيشل', 'سيراليون', 'سنغافورة', 'سلوفاكيا',
            'سلوفينيا', 'جزر سليمان', 'الصومال', 'جنوب أفريقيا', 'كوريا الجنوبية', 'جنوب السودان', 'إسبانيا', 'سريلانكا', 'السودان',
            'سورينام', 'السويد', 'سويسرا', 'سوريا', 'تايوان', 'طاجيكستان', 'تنزانيا', 'تايلاند', 'تيمور الشرقية', 'توغو', 'تونغا',
            'ترينيداد وتوباغو', 'تونس', 'تركيا', 'تركمانستان', 'توفالو', 'أوغندا', 'أوكرانيا', 'الإمارات العربية المتحدة', 'المملكة المتحدة',
            'الولايات المتحدة', 'أوروغواي', 'أوزبكستان', 'فانواتو', 'الفاتيكان', 'فنزويلا', 'فيتنام', 'اليمن', 'زامبيا', 'زيمبابوي'
        ];

        foreach ($countries as $country) {
            \App\Models\Country::create(['name' => $country]);
        }
    }
}
