<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\EmergencyService;

class EmergencyServicesSeeder extends Seeder
{
    public function run(): void
    {
        $services = [
            ['name' => 'سحب دم وريدي', 'price' => 25000],
            ['name' => 'سحب سوائل البطن', 'price' => 75000],
            ['name' => 'سحب سوائل بطن بوساطة سونار', 'price' => 125000],
            ['name' => 'سحب سوائل رئة بوساطة سونار', 'price' => 200000],
            ['name' => 'غسل أذن', 'price' => 5000],
            ['name' => 'غسل معدة', 'price' => 30000],
            ['name' => 'غسل معدة', 'price' => 35000],
            ['name' => 'فتح خراج صغير', 'price' => 25000],
            ['name' => 'فتح خراج كبير', 'price' => 75000],
            ['name' => 'فحص حاسبة', 'price' => 25000],
            ['name' => 'فحص طبيب الطوارئ', 'price' => 2000],
            ['name' => 'قلع أنظر', 'price' => 30000],
            ['name' => 'قلع كلي', 'price' => 50000],
            ['name' => 'قياس سكر', 'price' => 5000],
            ['name' => 'قياس ضغط', 'price' => 5000],
            ['name' => 'ماسك أوكسجين', 'price' => 5000],
            ['name' => 'مساج', 'price' => 5000],
            ['name' => 'وضع صندة ادرار', 'price' => 10000],
            ['name' => 'وضع صندة معدة', 'price' => 75000],
            ['name' => 'وضع كنترول', 'price' => 25000],
            ['name' => 'وضع كنترول', 'price' => 5000],
            ['name' => 'تخطيط قلب', 'price' => 20000],
            ['name' => 'BD safety glide im', 'price' => 25000],
            ['name' => 'linfopress evolution therapy (مساج)', 'price' => 50000],
            ['name' => 'إعادة فصل مفصل مغلق', 'price' => 150000],
            ['name' => 'إزالة قسطرة الجلد', 'price' => 5000],
            ['name' => 'إعطاء دم ومشتقاته', 'price' => 75000],
            ['name' => 'إعطاء سائل سول', 'price' => 15000],
            ['name' => 'إعطاء علاج', 'price' => 75000],
            ['name' => 'أوكسجين لمدة نصف ساعة', 'price' => 5000],
            ['name' => 'بيان ولادة', 'price' => 30000],
            ['name' => 'تجبير كسر', 'price' => 50000],
            ['name' => 'تجبير القدم أو الكاحل أو اليد جبسونية', 'price' => 50000],
            ['name' => 'تجبير القدم أو الكاحل أو اليد فايبر كلاس', 'price' => 50000],
            ['name' => 'تجبير الركبة جبسونية', 'price' => 50000],
            ['name' => 'تجبير تحت الركبة فايبر كلاس', 'price' => 50000],
            ['name' => 'تجبير تحت الركبة جبسونية', 'price' => 50000],
            ['name' => 'تجبير فوق الركبة فايبر كلاس', 'price' => 100000],
            ['name' => 'تجبير فوق الركبة جبسونية', 'price' => 75000],
            ['name' => 'تجبير فوق المرفق فايبر كلاس', 'price' => 75000],
            ['name' => 'تجبير فوق المرفق جبسونية', 'price' => 75000],
            ['name' => 'تخطيط قلب', 'price' => 25000],
            ['name' => 'تداوي السكري', 'price' => 25000],
            ['name' => 'تضميد الجروح المستمر', 'price' => 25000],
            ['name' => 'تضميد الجروح الكبرى', 'price' => 30000],
            ['name' => 'تقرير طبي', 'price' => 30000],
            ['name' => 'جهاز إنعاش', 'price' => 5000],
            ['name' => 'جهاز تخدير', 'price' => 10000],
            ['name' => 'حقيبة طبية لرفع المقعد', 'price' => 10000],
            ['name' => 'خروج مريض طوارئ 25', 'price' => 25000],
            ['name' => 'خروج مريض طوارئ 50', 'price' => 50000],
            ['name' => 'خروج مريض طوارئ 75', 'price' => 75000],
            ['name' => 'خياطة جرح سطحي أقل من 5 غرز', 'price' => 30000],
            ['name' => 'خياطة جرح سطحي أكثر من 5 غرز', 'price' => 75000],
            ['name' => 'خياطة جرح كبير', 'price' => 150000],
            ['name' => 'دخول الطوارئ للعناية', 'price' => 25000],
            ['name' => 'دخول الطوارئ ثلاث ساعات', 'price' => 25000],
            ['name' => 'دخول طوارئ ساعة', 'price' => 25000],
            ['name' => 'دخول طوارئ ساعتين', 'price' => 25000],
            ['name' => 'رفع خيط جرح كبير', 'price' => 15000],
            ['name' => 'رفع خيط جرح صغير', 'price' => 25000],
            ['name' => 'رفع مسندة الصدر', 'price' => 75000],
            ['name' => 'رفع مسندة عمل كوي', 'price' => 50000],
            ['name' => 'رقود طوارئ 6 ساعات', 'price' => 75000],
            ['name' => 'رزق أنس', 'price' => 3000],
            ['name' => 'رزق أبوبها خارجي', 'price' => 25000],
        ];
        
        foreach ($services as $service) {
            EmergencyService::create($service);
        }
    }
}